import React from "react";
import selfGrowth from "../assets/img/self-growth.jpg";
import code from "../assets/img/code.jpg";
import { IoIosArrowBack } from "react-icons/io";
import { useNavigate } from "react-router-dom";

const About = () => {
  const navigate = useNavigate();
  const redirector = () => {
    navigate("/");
  };
  return (
    <>
      <button onClick={redirector} className="back-button">
        <IoIosArrowBack />
      </button>
      <div className="about-page-container">
        <div className="about-container">
          <p>درباره من</p>
          <p>
            سلام من رسول هستم، یک توسعه‌دهنده فرانت‌ اند خودآموخته ، ساکن
            کرمانشاه.
          </p>
          <p>
            در سال 1400 با مشاوره و تشویق دو تن از دوستانم که توسعه دهندگان ارشد
            وب هستند، حوزه کاری قبلی خودم رو که تولید محتوا بود رو رها کردم و
            شروع به یادگیری اصول اولیه برنامه نویسی وب وبه طور ویژه فرانت اند
            کردم.
          </p>
          <p>
            با گذشت حدود شش سال از ازدواجم که شروع فاز جدید زندگیم محسوب می شد
            هیچ وقت شانس و فرصت این رو نداشتم که به علاقه واقعی و مسیر شغلی که
            می خواستم فکر کنم، اما بعد از اون روز و صحبت هایی که با دوستانم
            داشتم ایده ها و اهداف جدید و لذت بخشی توی ذهنم ایجاد شد و تصمیم بر
            ورود به مسیر تازه و جذابی که توی ذهنم تجسم می کردم گرفتم. با علاقه
            بسیارزیادی که به حوزه تکنولوژی داشتم و آشنایی با زبان انگلیسی و
            همچنین وجود منابع بسیار زیاد والبته کاربردی که توی این حوزه وجود
            داشت بلاخره مسیرتازه زندگیم رو استارت زدم .{" "}
          </p>
          <img
            loading="lazy"
            className="about-img"
            src={selfGrowth}
            alt="self-growth"
          ></img>
          <p>
            بعد از گذشت حدود ۵ ماه، آشنایی نسبی با مفاهیم پایه وزبان های نشانه
            گذاری Html و Css پیدا کردم و می تونستم قالب استاتیک تمرین ها و پروژه
            های خودم رو که قالبا از پروژه های تمرینی یوتیوب و سایت دریبل بودند
            رو پیاده کنم. در همین زمان شروع به یادگیری زبان برنامه نویسی جاوا
            اسکریپت کردم که شیرینی ارتباط با کامپیوتر نیروی محرکه ی جدیدی شد
            برای سرعت دادن به فرآیند یادگیریم. اما بعد از یک ماه از شروع یادگیری
            جاوا اسکریپت به این نتیجه رسیدم که برای سرعت بخشیدن به یادگیری و درک
            عمیق تر مطالب باید سراغ یک منبع حرفه ای و غیر رایگان برم
            <br></br>
            که بعد از کلی تحقیق با
            <span>
              <a href="https://fronthooks.ir/"> آکادمی فرانت هوکس </a>
            </span>
            آشنا شدم که بهترین تصمیم و اتفاق مسیر یادگیری من هم همین تصمیم بود.
          </p>
          <p>
            وقتی که به صورت خودآموخته شروع به یادگیری برنامه نویسی می کنید چالش
            ها و اتفاقات بد زیادی می تونه پیش روی شما قرار بگیره که از مهم ترین
            اون ها می تونم به مواجه با مباحث و مشکلاتی که به دلیل ندانستن جواب و
            پیچدگی اون مطلب چند روز شمارودرگیر خودش کنه، یا اینکه ممکنه توی این
            مسیر نسبتا طولانی یه جاهایی خسته شید و کم بیارید، اشاره کنم. اما
            هربار که هر کدوم از این چالش ها برای من اتفاق می افتاد با رسیدن به
            جواب و مروراهداف دوباره موتورم روشن می شد و لذت یادگیری چیزهای جدید
            من رو سرمست و مشتاق تر از قبل می کرد.{" "}
          </p>
          <p>
            و بعد از گذشت بیش از یک سال از شروع این مسیر جذاب، من کلی چیز تازه و
            مهارت کاربردی وتخصصی رو یادگرفتم که تونستم اون ها رو در قالب پروژه
            ها و مینی پروژه های متنوع تمرین کنم و نمایش بدم.<br></br> شما می
            تونید از
            <span>
              <a href="https://github.com/Rasool-Karami1994">اینجا</a>
            </span>
            تعدادی از این پروژه ها رو ببینید.
          </p>
          <p>
            مهمترین تکنولوژی های که من با اون ها کار می کنم:
            <ul>
              <li>- HTML, CSS (Sass)</li>
              <li>- JavaScript (ES6+)</li>
              <li>- React</li>
            </ul>
          </p>
          <p>
            من آمادگی این رو دارم که با مهارت های که کسب کردم به یک تیم حرفه ای
            ملحق شم و علاوه بر کمک به اون تیم تجربیات و مهارت های خودم رو ارتقا
            بدم. علاقه مند به کار با کتابخانه ری اکت و کار به صورت دورکار هستم
            واگر شماهم مثل من مایل به همکاری بودید می تونید از طریق آدرس پایین
            با من ارتباط بگیرید:<br></br>
            <span>
              <a href="mailto:rasoolkarami2304@gmail.com?cc=email-cc@gmail.com&bcc=email-bcc@gmail.com&subject=Subject Using Mailto.co.uk&body=Email Using Body">
                rasoolkarami2304@gmail.com
              </a>
            </span>
          </p>

          <img
            loading="lazy"
            className="about-img"
            src={code}
            alt="code-img"
          ></img>
        </div>
      </div>
    </>
  );
};

export default About;
